In [415]:
import pandas as pd
import numpy as np
import re

In [416]:
df = pd.read_csv('attacks.csv')

In [417]:
pd.options.display.max_columns = 100
pd.options.display.max_colwidth = 100

In [418]:
df.shape

(25723, 24)

In [419]:
df.head()

,Case Number,Date,Year,Type,Country,Area,Location,Activity,Name,Sex,Age,Injury,Fatal (Y/N),Time,Species,Investigator or Source,pdf,href formula,href,Case Number.1,Case Number.2,original order,Unnamed: 22,Unnamed: 23
0,2018.06.25,25-Jun-2018,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,F,57,"No injury to occupant, outrigger canoe and paddle damaged",N,18h00,White shark,"R. Collier, GSAF",2018.06.25-Wolfe.pdf,http://sharkattackfile.net/spreadsheets/pdf_directory/2018.06.25-Wolfe.pdf,http://sharkattackfile.net/spreadsheets/pdf_directory/2018.06.25-Wolfe.pdf,2018.06.25,2018.06.25,6303.0,NaN,NaN
1,2018.06.18,18-Jun-2018,2018.0,Unprovoked,USA,Georgia,"St. Simon Island, Glynn County",Standing,Adyson�McNeely,F,11,Minor injury to left thigh,N,14h00 -15h00,NaN,"K.McMurray, TrackingSharks.com",2018.06.18-McNeely.pdf,http://sharkattackfile.net/spreadsheets/pdf_directory/2018.06.18-McNeely.pdf,http://sharkattackfile.net/spreadsheets/pdf_directory/2018.06.18-McNeely.pdf,2018.06.18,2018.06.18,6302.0,NaN,NaN
2,2018.06.09,09-Jun-2018,2018.0,Invalid,USA,Hawaii,"Habush, Oahu",Surfing,John Denges,M,48,Injury to left lower leg from surfboard skeg,N,07h45,NaN,"K.McMurray, TrackingSharks.com",2018.06.09-Denges.pdf,http://sharkattackfile.net/spreadsheets/pdf_directory/2018.06.09-Denges.pdf,http://sharkattackfile.net/spreadsheets/pdf_directory/2018.06.09-Denges.pdf,2018.06.09,2018.06.09,6301.0,NaN,NaN
3,2018.06.08,08-Jun-2018,2018.0,Unprovoked,AUSTRALIA,New South Wales,Arrawarra Headland,Surfing,male,M,NaN,Minor injury to lower leg,N,NaN,2 m shark,"B. Myatt, GSAF",2018.06.08-Arrawarra.pdf,http://sharkattackfile.net/spreadsheets/pdf_directory/2018.06.08-Arrawarra.pdf,http://sharkattackfile.net/spreadsheets/pdf_directory/2018.06.08-Arrawarra.pdf,2018.06.08,2018.06.08,6300.0,NaN,NaN
4,2018.06.04,04-Jun-2018,2018.0,Provoked,MEXICO,Colima,La Ticla,Free diving,Gustavo Ramos,M,NaN,Lacerations to leg & hand shark PROVOKED INCIDENT,N,NaN,"Tiger shark, 3m",A .Kipper,2018.06.04-Ramos.pdf,http://sharkattackfile.net/spreadsheets/pdf_directory/2018.06.04-Ramos.pdf,http://sharkattackfile.net/spreadsheets/pdf_directory/2018.06.04-Ramos.pdf,2018.06.04,2018.06.04,6299.0,NaN,NaN

In [420]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25723 entries, 0 to 25722
Data columns (total 24 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Case Number             8702 non-null   object
 1   Date                    6302 non-null   object
 2   Year                    6300 non-null   float64
 3   Type                    6298 non-null   object
 4   Country                 6252 non-null   object
 5   Area                    5847 non-null   object
 6   Location                5762 non-null   object
 7   Activity                5758 non-null   object
 8   Name                    6092 non-null   object
 9   Sex                     5737 non-null   object
 10  Age                     3471 non-null   object
 11  Injury                  6274 non-null   object
 12  Fatal (Y/N)             5763 non-null   object
 13  Time                    2948 non-null   object
 14  Species                 3464 non-null   object
 15  Investigator or Source  6285 non-null   object
 16  pdf                     6302 non-null   object
 17  href formula            6301 non-null   object
 18  href                    6302 non-null   object
 19  Case Number.1           6302 non-null   object
 20  Case Number.2           6302 non-null   object
 21  original order          6309 non-null   float64
 22  Unnamed: 22             1 non-null      object
 23  Unnamed: 23             2 non-null      object
dtypes: float64(2), object(22)
memory usage: 4.7+ MB

In [421]:
df.drop_duplicates(keep='first', inplace=True)

In [422]:
df.shape

(6312, 24)

In [423]:
df = df.dropna(axis=0, thresh=.80)

In [424]:
df = df.drop(columns = ['Case Number', 'Year', 'Name', 'Age', 'Injury', 'Fatal (Y/N)', 'Investigator or Source', 'pdf', 'href formula', 'href', 'Case Number.1', 'Case Number.2', 'original order', 'Unnamed: 22', 'Unnamed: 23'])

In [425]:
df = df.drop(columns = ['Sex '])

In [426]:
df.head()

,Date,Type,Country,Area,Location,Activity,Time,Species
0,25-Jun-2018,Boating,USA,California,"Oceanside, San Diego County",Paddling,18h00,White shark
1,18-Jun-2018,Unprovoked,USA,Georgia,"St. Simon Island, Glynn County",Standing,14h00 -15h00,NaN
2,09-Jun-2018,Invalid,USA,Hawaii,"Habush, Oahu",Surfing,07h45,NaN
3,08-Jun-2018,Unprovoked,AUSTRALIA,New South Wales,Arrawarra Headland,Surfing,NaN,2 m shark
4,04-Jun-2018,Provoked,MEXICO,Colima,La Ticla,Free diving,NaN,"Tiger shark, 3m"

In [427]:
len(df['Activity'].unique())

1533

In [428]:
df['Activity'].value_counts().head(15)

Surfing           971
Swimming          869
Fishing           431
Spearfishing      333
Bathing           162
Wading            149
Diving            127
Standing           99
Snorkeling         89
Scuba diving       76
Body boarding      61
Body surfing       49
Swimming           47
Kayaking           33
Treading water     32
Name: Activity, dtype: int64

In [429]:
df['Activity'] = df['Activity'].astype(str).str.lower()
df['Activity'] = df['Activity'].str.strip()

In [430]:
def activity_clean(row):
    surf = re.findall('[s][u][r][f]\w*', row['Activity'])
    swimming = re.findall('[s][w][i][m][m][i][n][g]\w*', row['Activity'])
    fishing = re.findall('[f][i][s][h][i][n][g]\w*', row['Activity'])
    spearfishing = re.findall('[s][p][e][a][r][f][i][s][h][i][n][g]\w*', row['Activity'])
    bathing = re.findall('[b][a][t][h][i][n][g]\w*', row['Activity'])
    wading = re.findall('[w][a][d][i][n][g]\w*', row['Activity'])
    diving = re.findall('[d][i][v][i][n][g]\w*', row['Activity'])
    standing = re.findall('[s][t][a][n][d][i][n][g]\w*', row['Activity'])
    if len(surf) != 0:
        return "SURFING"
    elif len(swimming) != 0:
        return "SWIMMING" 
    elif len(fishing) != 0:
        return "FISHING"  
    elif len(spearfishing) != 0:
        return "SPEARFISHING" 
    elif len(bathing) != 0:
        return "BATHING" 
    elif len(wading) != 0:
        return "WADING"  
    elif len(diving) != 0:
        return "DIVING" 
    elif len(standing) != 0:
        return "STANDING"
    else:
        return "Others"

In [431]:
df['Activity'] = df.apply(activity_clean, axis = 1)

In [432]:
df['Activity'].value_counts(ascending = False)

Others      1827
SURFING     1261
FISHING     1132
SWIMMING    1100
DIVING       509
BATHING      188
WADING       164
STANDING     130
Name: Activity, dtype: int64

In [433]:
df

,Date,Type,Country,Area,Location,Activity,Time,Species
0,25-Jun-2018,Boating,USA,California,"Oceanside, San Diego County",Others,18h00,White shark
1,18-Jun-2018,Unprovoked,USA,Georgia,"St. Simon Island, Glynn County",STANDING,14h00 -15h00,NaN
2,09-Jun-2018,Invalid,USA,Hawaii,"Habush, Oahu",SURFING,07h45,NaN
3,08-Jun-2018,Unprovoked,AUSTRALIA,New South Wales,Arrawarra Headland,SURFING,NaN,2 m shark
4,04-Jun-2018,Provoked,MEXICO,Colima,La Ticla,DIVING,NaN,"Tiger shark, 3m"
...,...,...,...,...,...,...,...,...
6306,NaN,NaN,NaN,NaN,NaN,Others,NaN,NaN
6307,NaN,NaN,NaN,NaN,NaN,Others,NaN,NaN
6308,NaN,NaN,NaN,NaN,NaN,Others,NaN,NaN
6309,NaN,NaN,NaN,NaN,NaN,Others,NaN,NaN
25722,NaN,NaN,NaN,NaN,NaN,Others,NaN,NaN

In [434]:
len(df['Date'].unique())

5434

In [435]:
df['Date'].value_counts().head(15)

1957                    11
1942                     9
1956                     8
1950                     7
1941                     7
1958                     7
1949                     6
No date                  6
1940                     5
12-Apr-2001              5
1955                     5
1954                     5
Aug-1956                 5
Oct-1960                 5
No date, Before 1963     5
Name: Date, dtype: int64

In [436]:
df['Date'] = df['Date'].astype(str).str.lower()
df['Date'] = df['Date'].str.strip()

In [437]:
def year(x):
    res = re.search(r'([0-9]{4})', str(x))
    if res is None:
        return None
    else:
        return int(res.group())

In [438]:
def month(x):
    res = re.search(r'(?!-)(([A-Za-z]{3}))(?=-)', str(x))
    if res is None:
        return None
    else:
        return str(res.group())

In [439]:
def day(x):
    res = re.search(r'(^|\b)(([0-9]{2}))(?=-)',str(x))
    if res is None:
        return None
    else:
        return str(res.group())

In [440]:
df['Day'] = df.Date.apply(day)

In [441]:
df['Month'] = df.Date.apply(month)

In [442]:
df['Year'] = df.Date.apply(year)

In [443]:
df.head(5)

,Date,Type,Country,Area,Location,Activity,Time,Species,Day,Month,Year
0,25-jun-2018,Boating,USA,California,"Oceanside, San Diego County",Others,18h00,White shark,25,jun,2018.0
1,18-jun-2018,Unprovoked,USA,Georgia,"St. Simon Island, Glynn County",STANDING,14h00 -15h00,NaN,18,jun,2018.0
2,09-jun-2018,Invalid,USA,Hawaii,"Habush, Oahu",SURFING,07h45,NaN,09,jun,2018.0
3,08-jun-2018,Unprovoked,AUSTRALIA,New South Wales,Arrawarra Headland,SURFING,NaN,2 m shark,08,jun,2018.0
4,04-jun-2018,Provoked,MEXICO,Colima,La Ticla,DIVING,NaN,"Tiger shark, 3m",04,jun,2018.0

In [444]:
df = df[df['Month'].map(df['Month'].value_counts())>5]

In [445]:
df['Day'].value_counts(ascending = True).head(5)

31    106
17    150
20    153
23    157
30    159
Name: Day, dtype: int64

In [446]:
df['Month'].value_counts()

jul    663
aug    599
sep    552
jan    517
jun    494
apr    452
oct    444
dec    435
mar    412
nov    408
feb    381
may    371
Name: Month, dtype: int64

In [447]:
df['Year'].value_counts()

2015.0    142
2017.0    136
2016.0    130
2014.0    125
2011.0    125
         ...
1811.0      1
1802.0      1
1828.0      1
1819.0      1
1806.0      1
Name: Year, Length: 220, dtype: int64

In [448]:
df = df.drop(columns = ['Date'])

In [449]:
df.head(5)

,Type,Country,Area,Location,Activity,Time,Species,Day,Month,Year
0,Boating,USA,California,"Oceanside, San Diego County",Others,18h00,White shark,25,jun,2018.0
1,Unprovoked,USA,Georgia,"St. Simon Island, Glynn County",STANDING,14h00 -15h00,NaN,18,jun,2018.0
2,Invalid,USA,Hawaii,"Habush, Oahu",SURFING,07h45,NaN,09,jun,2018.0
3,Unprovoked,AUSTRALIA,New South Wales,Arrawarra Headland,SURFING,NaN,2 m shark,08,jun,2018.0
4,Provoked,MEXICO,Colima,La Ticla,DIVING,NaN,"Tiger shark, 3m",04,jun,2018.0

In [450]:
len(df['Type'].unique())

9

In [451]:
df['Type'].value_counts().head(10)

Unprovoked      4160
Provoked         538
Invalid          501
Sea Disaster     216
Boating          181
Boat             125
Questionable       2
Boatomg            1
Name: Type, dtype: int64

In [452]:
df['Type'] = df['Type'].astype(str).str.lower()
df['Type'] = df['Type'].str.strip()

In [453]:
def type_clean(row):
    provoked = re.findall('[p][r][o][v][o][k][e][d]\w*', row['Type'])
    boat = re.findall('[b][o][a][t]\w*', row['Type'])
    unprovoked = re.findall('[u][n][p][r][o][v][o][k][e][d]\w*', row['Type'])
    if len(provoked) != 0:
        return "PROVOKED"
    elif len(boat) != 0:
        return "BOAT"
    elif len(unprovoked) != 0:
        return "UNPROVOKED"
    else:
        return "INVALID"

In [454]:
df['Type'] = df.apply(type_clean, axis = 1)

In [455]:
df

,Type,Country,Area,Location,Activity,Time,Species,Day,Month,Year
0,BOAT,USA,California,"Oceanside, San Diego County",Others,18h00,White shark,25,jun,2018.0
1,PROVOKED,USA,Georgia,"St. Simon Island, Glynn County",STANDING,14h00 -15h00,NaN,18,jun,2018.0
2,INVALID,USA,Hawaii,"Habush, Oahu",SURFING,07h45,NaN,09,jun,2018.0
3,PROVOKED,AUSTRALIA,New South Wales,Arrawarra Headland,SURFING,NaN,2 m shark,08,jun,2018.0
4,PROVOKED,MEXICO,Colima,La Ticla,DIVING,NaN,"Tiger shark, 3m",04,jun,2018.0
...,...,...,...,...,...,...,...,...,...,...
6246,PROVOKED,BERMUDA,Paget,Paget Parish,FISHING,NaN,NaN,None,apr,1959.0
6257,PROVOKED,NORTH PACIFIC OCEAN,NaN,Wake Island,FISHING,NaN,NaN,None,mar,1956.0
6288,PROVOKED,USA,North Carolina,Somewhere between Hatteras and Beaufort,SWIMMING,NaN,NaN,17,jul,1916.0
6289,PROVOKED,SOUTH AFRICA,KwaZulu-Natal,Durban,FISHING,NaN,NaN,19,jul,1913.0
6290,PROVOKED,SOUTH AFRICA,KwaZulu-Natal,Durban,WADING,NaN,NaN,19,jul,1913.0

In [456]:
df = df.drop(columns = ['Location'])

In [457]:
df.head(5)

,Type,Country,Area,Activity,Time,Species,Day,Month,Year
0,BOAT,USA,California,Others,18h00,White shark,25,jun,2018.0
1,PROVOKED,USA,Georgia,STANDING,14h00 -15h00,NaN,18,jun,2018.0
2,INVALID,USA,Hawaii,SURFING,07h45,NaN,09,jun,2018.0
3,PROVOKED,AUSTRALIA,New South Wales,SURFING,NaN,2 m shark,08,jun,2018.0
4,PROVOKED,MEXICO,Colima,DIVING,NaN,"Tiger shark, 3m",04,jun,2018.0

In [458]:
len(df['Area'].unique())

734

In [459]:
df['Area'].value_counts().head(10)

Florida                  992
New South Wales          467
Queensland               299
California               283
Hawaii                   275
KwaZulu-Natal            202
Western Cape Province    184
Western Australia        180
Eastern Cape Province    149
South Carolina           148
Name: Area, dtype: int64

In [460]:
df['Area'] = df['Area'].astype(str).str.lower()
df['Area'] = df['Area'].str.strip()

In [461]:
def area_clean(row):
    florida = re.findall('[f][l][o][r][i][d][a]\w*', row['Area'])
    if len(florida) != 0:
        return "FLORIDA"
    else:
        return "INVALID"

In [462]:
df['Area'] = df.apply(area_clean, axis = 1)

In [463]:
df.head(10)

,Type,Country,Area,Activity,Time,Species,Day,Month,Year
0,BOAT,USA,INVALID,Others,18h00,White shark,25,jun,2018.0
1,PROVOKED,USA,INVALID,STANDING,14h00 -15h00,NaN,18,jun,2018.0
2,INVALID,USA,INVALID,SURFING,07h45,NaN,09,jun,2018.0
3,PROVOKED,AUSTRALIA,INVALID,SURFING,NaN,2 m shark,08,jun,2018.0
4,PROVOKED,MEXICO,INVALID,DIVING,NaN,"Tiger shark, 3m",04,jun,2018.0
5,PROVOKED,AUSTRALIA,INVALID,SURFING,NaN,NaN,03,jun,2018.0
6,PROVOKED,BRAZIL,INVALID,SWIMMING,Late afternoon,Tiger shark,03,jun,2018.0
7,PROVOKED,USA,FLORIDA,FISHING,NaN,"Lemon shark, 3'",27,may,2018.0
8,PROVOKED,USA,FLORIDA,Others,17h00,"Bull shark, 6'",26,may,2018.0
9,PROVOKED,USA,FLORIDA,STANDING,14h00,NaN,26,may,2018.0

In [464]:
df['Area'].value_counts(ascending = True).head(5)

FLORIDA     994
INVALID    4734
Name: Area, dtype: int64

In [465]:
len(df['Country'].unique())

190

In [466]:
df['Country'].value_counts().head(10)

USA                 2116
AUSTRALIA           1266
SOUTH AFRICA         545
NEW ZEALAND          119
BRAZIL               111
BAHAMAS               99
PAPUA NEW GUINEA      96
MEXICO                81
ITALY                 57
PHILIPPINES           56
Name: Country, dtype: int64

In [467]:
df['Country'] = df['Country'].astype(str).str.lower()
df['Country'] = df['Country'].str.strip()

In [468]:
def country_clean(row):
    usa = re.findall('[u][s][a]\w*', row['Country'])
    if len(usa) != 0:
        return "USA"
    else:
        return "INVALID"

In [469]:
df['Country'] = df.apply(country_clean, axis = 1)

In [470]:
df['Country'].value_counts().head(10)

INVALID    3612
USA        2116
Name: Country, dtype: int64

In [471]:
df.head(10)

,Type,Country,Area,Activity,Time,Species,Day,Month,Year
0,BOAT,USA,INVALID,Others,18h00,White shark,25,jun,2018.0
1,PROVOKED,USA,INVALID,STANDING,14h00 -15h00,NaN,18,jun,2018.0
2,INVALID,USA,INVALID,SURFING,07h45,NaN,09,jun,2018.0
3,PROVOKED,INVALID,INVALID,SURFING,NaN,2 m shark,08,jun,2018.0
4,PROVOKED,INVALID,INVALID,DIVING,NaN,"Tiger shark, 3m",04,jun,2018.0
5,PROVOKED,INVALID,INVALID,SURFING,NaN,NaN,03,jun,2018.0
6,PROVOKED,INVALID,INVALID,SWIMMING,Late afternoon,Tiger shark,03,jun,2018.0
7,PROVOKED,USA,FLORIDA,FISHING,NaN,"Lemon shark, 3'",27,may,2018.0
8,PROVOKED,USA,FLORIDA,Others,17h00,"Bull shark, 6'",26,may,2018.0
9,PROVOKED,USA,FLORIDA,STANDING,14h00,NaN,26,may,2018.0

In [472]:
len(df['Species '].unique())

1483

In [473]:
#ajustar nome da coluna

In [474]:
df['Species '].value_counts().head(30)

White shark                                           149
Shark involvement prior to death was not confirmed    100
Invalid                                                94
Shark involvement not confirmed                        84
Tiger shark                                            65
Shark involvement prior to death unconfirmed           59
Bull shark                                             42
4' shark                                               40
6' shark                                               38
1.8 m [6'] shark                                       32
Questionable                                           29
Questionable incident                                  28
1.5 m [5'] shark                                       28
3' shark                                               26
1.2 m [4'] shark                                       26
5' shark                                               25
2 m shark                                              24
4' to 5' shark                                         24
3 m [10'] shark                                        22
No shark involvement                                   21
Wobbegong shark                                        19
3' to 4' shark                                         18
3 m shark                                              17
2.4 m [8'] shark                                       16
Blacktip shark                                         15
12' shark                                              15
3.7 m [12'] shark                                      14
1.5 m shark                                            13
Mako shark                                             13
7' shark                                               13
Name: Species , dtype: int64

In [475]:
df['Species '] = df['Species '].astype(str).str.lower()
df['Species '] = df['Species '].str.strip()

In [476]:
def species_clean(row):
    whiteshark = re.findall('[w][h][i][t][e][ ][s][h][a][r][k]\w*', row['Species '])
    tigershark = re.findall('[t][i][g][e][r][ ][s][h][a][r][k]\w*', row['Species '])
    bullshark = re.findall('[b][u][l][l][ ][s][h][a][r][k]\w*', row['Species '])
    wobbegongshark = re.findall('[w][o][b][b][e][g][o][n][g][ ][s][h][a][r][k]\w*', row['Species '])
    blacktipshark = re.findall('[b][l][a][c][k][t][i][p][ ][s][h][a][r][k]\w*', row['Species '])
    if len(whiteshark) != 0:
        return "WHITE SHARK"
    elif len(tigershark) != 0:
        return "TIGER SHARK"
    elif len(bullshark) != 0:
        return "BULL SHARK"
    elif len(wobbegongshark) != 0:
        return "WOBBEGONG SHARK"  
    elif len(blacktipshark) != 0:
        return "BLACKTIP SHARK"
    else:
        return "INVALID"

In [477]:
df['Species '] = df.apply(species_clean, axis = 1)

In [478]:
df['Species '].value_counts().head(10)

INVALID            4585
WHITE SHARK         605
TIGER SHARK         269
BULL SHARK          162
BLACKTIP SHARK       63
WOBBEGONG SHARK      44
Name: Species , dtype: int64

In [479]:
df.head(15)

,Type,Country,Area,Activity,Time,Species,Day,Month,Year
0,BOAT,USA,INVALID,Others,18h00,WHITE SHARK,25,jun,2018.0
1,PROVOKED,USA,INVALID,STANDING,14h00 -15h00,INVALID,18,jun,2018.0
2,INVALID,USA,INVALID,SURFING,07h45,INVALID,09,jun,2018.0
3,PROVOKED,INVALID,INVALID,SURFING,NaN,INVALID,08,jun,2018.0
4,PROVOKED,INVALID,INVALID,DIVING,NaN,TIGER SHARK,04,jun,2018.0
5,PROVOKED,INVALID,INVALID,SURFING,NaN,INVALID,03,jun,2018.0
6,PROVOKED,INVALID,INVALID,SWIMMING,Late afternoon,TIGER SHARK,03,jun,2018.0
7,PROVOKED,USA,FLORIDA,FISHING,NaN,INVALID,27,may,2018.0
8,PROVOKED,USA,FLORIDA,Others,17h00,BULL SHARK,26,may,2018.0
9,PROVOKED,USA,FLORIDA,STANDING,14h00,INVALID,26,may,2018.0
10,PROVOKED,INVALID,INVALID,Others,Morning,INVALID,24,may,2018.0
11,PROVOKED,USA,INVALID,Others,NaN,INVALID,21,may,2018.0
12,PROVOKED,USA,INVALID,SWIMMING,15h00,INVALID,13,may,2018.0
13,INVALID,INVALID,INVALID,FISHING,08h15,INVALID,13,may,2018.0
15,PROVOKED,INVALID,INVALID,SURFING,11h00,INVALID,12,may,2018.0

In [480]:
len(df['Time'].unique())

363

In [481]:
df['Time'].value_counts().head(20)

Afternoon    179
11h00        125
Morning      118
15h00        107
12h00        106
16h00        100
14h00         96
16h30         74
14h30         73
17h00         71
17h30         70
13h00         68
18h00         68
15h30         65
11h30         61
13h30         60
Night         59
10h00         57
09h00         50
10h30         48
Name: Time, dtype: int64

In [482]:
df['Time'] = df['Time'].astype(str).str.lower()
df['Time'] = df['Time'].str.strip()

In [483]:
df.replace({"Time": {"nan": "INVALID", "late afternoon": "17h00", "morning": "9h00", "afternoon": "15h00", "night": "21h00"}}, inplace=True)

In [484]:
df['Time'].value_counts().head(20)

INVALID    2831
15h00       286
11h00       125
9h00        120
12h00       106
17h00       105
16h00       100
14h00        97
16h30        74
14h30        73
17h30        70
13h00        68
18h00        68
15h30        65
21h00        63
11h30        62
13h30        60
10h00        57
09h00        50
10h30        48
Name: Time, dtype: int64

In [485]:
df.head(15)

,Type,Country,Area,Activity,Time,Species,Day,Month,Year
0,BOAT,USA,INVALID,Others,18h00,WHITE SHARK,25,jun,2018.0
1,PROVOKED,USA,INVALID,STANDING,14h00 -15h00,INVALID,18,jun,2018.0
2,INVALID,USA,INVALID,SURFING,07h45,INVALID,09,jun,2018.0
3,PROVOKED,INVALID,INVALID,SURFING,INVALID,INVALID,08,jun,2018.0
4,PROVOKED,INVALID,INVALID,DIVING,INVALID,TIGER SHARK,04,jun,2018.0
5,PROVOKED,INVALID,INVALID,SURFING,INVALID,INVALID,03,jun,2018.0
6,PROVOKED,INVALID,INVALID,SWIMMING,17h00,TIGER SHARK,03,jun,2018.0
7,PROVOKED,USA,FLORIDA,FISHING,INVALID,INVALID,27,may,2018.0
8,PROVOKED,USA,FLORIDA,Others,17h00,BULL SHARK,26,may,2018.0
9,PROVOKED,USA,FLORIDA,STANDING,14h00,INVALID,26,may,2018.0
10,PROVOKED,INVALID,INVALID,Others,9h00,INVALID,24,may,2018.0
11,PROVOKED,USA,INVALID,Others,INVALID,INVALID,21,may,2018.0
12,PROVOKED,USA,INVALID,SWIMMING,15h00,INVALID,13,may,2018.0
13,INVALID,INVALID,INVALID,FISHING,08h15,INVALID,13,may,2018.0
15,PROVOKED,INVALID,INVALID,SURFING,11h00,INVALID,12,may,2018.0

In [486]:
df.shape

(5728, 9)

In [487]:
df = df.dropna(axis=0, subset=['Time'])

In [488]:
df.dropna(axis=0, how='all', inplace = True)

In [489]:
df.shape

(5728, 9)

In [496]:
df['Country'].value_counts().head(20)

INVALID    3612
USA        2116
Name: Country, dtype: int64

In [497]:
df['Area'].value_counts().head(20)

INVALID    4734
FLORIDA     994
Name: Area, dtype: int64

In [529]:
df.groupby('Activity')['Month'].mean().sort_values().head()

DataError: No numeric types to aggregate

In [516]:
df.groupby('Activity').size().sort_values(ascending=False).head(8)

Activity
Others      1584
SURFING     1234
FISHING     1024
SWIMMING    1013
DIVING       429
BATHING      168
WADING       156
STANDING     120
dtype: int64

In [532]:
df.groupby('Time').size().sort_values(ascending=False).head(20)

Time
INVALID    2831
15h00       286
11h00       125
9h00        120
12h00       106
17h00       105
16h00       100
14h00        97
16h30        74
14h30        73
17h30        70
13h00        68
18h00        68
15h30        65
21h00        63
11h30        62
13h30        60
10h00        57
09h00        50
10h30        48
dtype: int64